<?php

/** @var yii\web\View $this */

use yii\helpers\Html;

$this->title = 'О нас';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <p>
        Этот проект предназначен, как блог-шпаргалка в программировании для более быстрого программирования, а также накопления знаний, которые пригождаются программисту в рутинной, постоянной работе.<br><br>

        Здесь собраны исходники кода и статьи по PHP, CSS, HTML, SQL, Delphi, Yii2, Laravel, MySQL, PostgreSQL, JavaScript, JQuery, Bootstrap, Bitrix, Modx. Методические статьи и заметки помогут Вам быстрее решить проблемы или успешно пройти собеседование на работе. Кроме того базу знаний можно расширять и пополнять, добавляя все новые и новые статьи о программировании. Для этого лишь необходимо зарегистрироваться, и разместить свою статью, внести лепту знаний в общую копилку. Это позволит накопить знания, и аккумулировать полезные советы, статьи, заметки в единую сеть знаний программиста.<br><br>

        Эти материалы дополняются схемами, картинками, исходниками кода, что также повышает наглядность статей. Используйте данную возможность, чтобы узнать что-то новое, или стать автором статьей и научно-программных заметок. Новички и гуру смогут узнать что-то новое для себя, читая данные материалы. Кроме того передача опыта от более опытных к новичкам-программистам по сути закаляет и развивает самих опытных учителей-программистов. Закрепляются знания, появляется система упорядоченных данных и логики программирования. Связаться с автором статьи можно будет через почту, таким образом между читателями и авторами образуется прямая связь.<br><br>

        Успехов в изучении новых языков программирования, а также в освоении технологий программирования! Пусть каждый из Вас растет профессионально от новичка до профи-гуру, от юниора-стажера до сеньора-tm. Знания полученные здесь всегда пригодятся в работе, помогут быстрее выполнить свою работу, тестовое задание или просто узнать что-то новое.<br><br>

        Удачи, с уважением администрация Solaric!
    </p>

    <!--<code><?//= __FILE__ ?></code>-->
</div>
